In [1]:
import pandas as pd
import numpy as np

In [2]:
pay = pd.read_csv('City_of_Chicago_Payroll_Data.csv')

In [3]:
pay

,Unnamed: 0,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary,Hr Rate
0,0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,$107790.00,NaN,107790.0,NaN
1,1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN,104628.0,NaN
2,2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN,114324.0,NaN
3,3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,$76932.00,NaN,76932.0,NaN
4,4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN,111474.0,NaN
...,...,...,...,...,...,...,...,...,...,...,...
32653,32653,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,F,Salary,NaN,$90024.00,NaN,90024.0,NaN
32654,32654,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,$48078.00,NaN,48078.0,NaN
32655,32655,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,$87006.00,NaN,87006.0,NaN
32656,32656,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,$93354.00,NaN,93354.0,NaN
32657,32657,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,NaN,$115932.00,NaN,115932.0,NaN

In [4]:
pay.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32658 entries, 0 to 32657
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         32658 non-null  int64
 1   Name               32658 non-null  object
 2   Job Titles         32658 non-null  object
 3   Department         32658 non-null  object
 4   Full or Part-Time  32658 non-null  object
 5   Salary or Hourly   32658 non-null  object
 6   Typical Hours      7883 non-null   float64
 7   Annual Salary      24775 non-null  object
 8   Hourly Rate        7883 non-null   object
 9   Salary             24775 non-null  float64
 10  Hr Rate            7883 non-null   float64
dtypes: float64(3), int64(1), object(7)
memory usage: 2.7+ MB

In [5]:
pay.isna().sum()

Unnamed: 0               0
Name                     0
Job Titles               0
Department               0
Full or Part-Time        0
Salary or Hourly         0
Typical Hours        24775
Annual Salary         7883
Hourly Rate          24775
Salary                7883
Hr Rate              24775
dtype: int64

In [6]:
pay.describe()

         Unnamed: 0  Typical Hours         Salary      Hr Rate
count  32658.000000    7883.000000   24775.000000  7883.000000
mean   16328.500000      34.698719   87512.780241    32.868192
std     9427.696882       9.145553   20563.723361    12.124440
min        0.000000      10.000000       0.960000     2.650000
25%     8164.250000      20.000000   76932.000000    21.200000
50%    16328.500000      40.000000   90024.000000    35.600000
75%    24492.750000      40.000000   97368.000000    40.200000
max    32657.000000      40.000000  300000.000000    96.000000

## 1. What are the maximum, minimum and average Typical Hours? (use ‘Typical Hours’ column)

In [7]:
print('max: ', pay['Typical Hours'].max())
print('min: ', pay['Typical Hours'].min())
print('average: ', pay['Typical Hours'].mean())

max:  40.0
min:  10.0
average:  34.69871876189268

## 2. How many employees are on salary and how many are working on hourly basis?

In [8]:
pay['Salary or Hourly'].value_counts()   #solution 1

Salary or Hourly
Salary    24775
Hourly     7883
Name: count, dtype: int64

In [9]:
pay.groupby('Salary or Hourly').count()[['Name']]   #solution 2

                   Name
Salary or Hourly
Hourly             7883
Salary            24775

## 3. Which department has maximum no of employees?

In [10]:
pay.groupby('Department').count()[['Name']].sort_values(['Name'], ascending = False).head(1) #solution 1

             Name
Department
POLICE      12973

In [11]:
pay.groupby('Department').count()[['Name']].idxmax()  #solution 2

Name    POLICE
dtype: object

In [12]:
pay['Department'].value_counts().head(1)  #solution 3

Department
POLICE    12973
Name: count, dtype: int64

## 4. How many employees are on Salary and how many are on Hourly in the Police department?

In [13]:
pay[pay['Department'] == 'POLICE'] ['Salary or Hourly'].value_counts()   #solution 1

Salary or Hourly
Salary    12941
Hourly       32
Name: count, dtype: int64

In [14]:
pay[pay['Department'] == 'POLICE'].groupby('Salary or Hourly')['Name'].count()    #solution 2

Salary or Hourly
Hourly       32
Salary    12941
Name: Name, dtype: int64

## 5. What are the mean, max and min salaries?

In [15]:
pay['Salary'] = pay['Annual Salary'].str.replace('$','').astype(float)

In [16]:
pay

,Unnamed: 0,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary,Hr Rate
0,0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,$107790.00,NaN,107790.0,NaN
1,1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN,104628.0,NaN
2,2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN,114324.0,NaN
3,3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,$76932.00,NaN,76932.0,NaN
4,4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN,111474.0,NaN
...,...,...,...,...,...,...,...,...,...,...,...
32653,32653,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,F,Salary,NaN,$90024.00,NaN,90024.0,NaN
32654,32654,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,$48078.00,NaN,48078.0,NaN
32655,32655,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,$87006.00,NaN,87006.0,NaN
32656,32656,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,$93354.00,NaN,93354.0,NaN
32657,32657,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,NaN,$115932.00,NaN,115932.0,NaN

In [17]:
pay.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32658 entries, 0 to 32657
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         32658 non-null  int64
 1   Name               32658 non-null  object
 2   Job Titles         32658 non-null  object
 3   Department         32658 non-null  object
 4   Full or Part-Time  32658 non-null  object
 5   Salary or Hourly   32658 non-null  object
 6   Typical Hours      7883 non-null   float64
 7   Annual Salary      24775 non-null  object
 8   Hourly Rate        7883 non-null   object
 9   Salary             24775 non-null  float64
 10  Hr Rate            7883 non-null   float64
dtypes: float64(3), int64(1), object(7)
memory usage: 2.7+ MB

In [18]:
print('Mean value: ', pay['Salary'].mean())
print('Maximum Value: ', pay['Salary'].max())
print('MInimum Value: ', pay['Salary'].min())

Mean value:  87512.78024137235
Maximum Value:  300000.0
MInimum Value:  0.96

## 6. Find an employee who has the maximum salary

In [19]:
pay.loc[pay['Salary'].idxmax(),'Name']  #solution 1

'EVANS,  GINGER S'

In [20]:
pay[pay['Salary'] == 300000.0]    #solution 2

,Unnamed: 0,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary,Hr Rate
8310,8310,"EVANS, GINGER S",COMMISSIONER OF AVIATION,AVIATION,F,Salary,NaN,$300000.00,NaN,300000.0,NaN

In [21]:
pay.loc[pay['Salary'] == 300000.0, 'Name']   #solution 3

8310    EVANS,  GINGER S
Name: Name, dtype: object

In [22]:
pay[pay['Salary'] == pay['Salary'].max()]  #solution 4 (Best Solution)

,Unnamed: 0,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary,Hr Rate
8310,8310,"EVANS, GINGER S",COMMISSIONER OF AVIATION,AVIATION,F,Salary,NaN,$300000.00,NaN,300000.0,NaN

## 7. What are the mean, max and min Hourly Rate?

In [23]:
pay['Hr Rate'] = pay['Hourly Rate'].str.replace('$','').astype(float)

In [24]:
pay.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32658 entries, 0 to 32657
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         32658 non-null  int64
 1   Name               32658 non-null  object
 2   Job Titles         32658 non-null  object
 3   Department         32658 non-null  object
 4   Full or Part-Time  32658 non-null  object
 5   Salary or Hourly   32658 non-null  object
 6   Typical Hours      7883 non-null   float64
 7   Annual Salary      24775 non-null  object
 8   Hourly Rate        7883 non-null   object
 9   Salary             24775 non-null  float64
 10  Hr Rate            7883 non-null   float64
dtypes: float64(3), int64(1), object(7)
memory usage: 2.7+ MB

In [25]:
print('Mean Value: ', pay['Hr Rate'].mean())
print('Max Value: ', pay['Hr Rate'].max())
print('Min Value: ', pay['Hr Rate'].min())

Mean Value:  32.86819231257135
Max Value:  96.0
Min Value:  2.65

## 8. How many employees are getting max Hourly Rate?

In [26]:
pay[pay['Hr Rate'] == pay['Hr Rate'].max()]  [['Name']].count()

Name    1
dtype: int64

# 9. Who is getting max Hourly Rate?

In [27]:
pay[pay['Hr Rate'] == pay['Hr Rate'].max()]     #solution 1

,Unnamed: 0,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary,Hr Rate
14317,14317,"JONES, JOHN W",PSYCHIATRIST,HEALTH,F,Hourly,35.0,NaN,$96.00,NaN,96.0

In [28]:
pay.iloc[pay['Hr Rate'].idxmax()]   #solution 2

Unnamed: 0                    14317
Name                 JONES,  JOHN W
Job Titles             PSYCHIATRIST
Department                   HEALTH
Full or Part-Time                 F
Salary or Hourly             Hourly
Typical Hours                  35.0
Annual Salary                   NaN
Hourly Rate                  $96.00
Salary                          NaN
Hr Rate                        96.0
Name: 14317, dtype: object

# 10. How many employees are earning less than the average Hourly Rate?

In [29]:
pay[pay['Hr Rate'] < pay['Hr Rate'].mean()].count()

Unnamed: 0           2791
Name                 2791
Job Titles           2791
Department           2791
Full or Part-Time    2791
Salary or Hourly     2791
Typical Hours        2791
Annual Salary           0
Hourly Rate          2791
Salary                  0
Hr Rate              2791
dtype: int64

# 11. How many employees are paid hourly and they have full-time job?

In [30]:
pay[(pay['Salary or Hourly'] == 'Hourly') & (pay['Full or Part-Time'] == 'F')].count()

Unnamed: 0           5906
Name                 5906
Job Titles           5906
Department           5906
Full or Part-Time    5906
Salary or Hourly     5906
Typical Hours        5906
Annual Salary           0
Hourly Rate          5906
Salary                  0
Hr Rate              5906
dtype: int64

# 12. Find the full-time employees who are working at hourly rate of $10.00?

In [31]:
pay[(pay['Full or Part-Time'] == 'F') & (pay['Hr Rate'] == 10.00)]

,Unnamed: 0,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary,Hr Rate
1232,1232,"AYALA JR, JESUS",STUDENT INTERN,HUMAN RESOURCES,F,Hourly,35.0,NaN,$10.00,NaN,10.0
4522,4522,"CERVANTES, BIANCA A",STUDENT INTERN,BUDGET & MGMT,F,Hourly,35.0,NaN,$10.00,NaN,10.0
6476,6476,"DAVILA, ROBERTO A",ALDERMANIC AIDE,CITY COUNCIL,F,Hourly,35.0,NaN,$10.00,NaN,10.0
16474,16474,"LEVY, ETHAN",CLERK CITY COUNCIL,CITY COUNCIL,F,Hourly,35.0,NaN,$10.00,NaN,10.0

# 13. How many unique Job Titles are there in the data?

In [32]:
pay['Job Titles'].nunique()

1095

## 14. What was the average salary of the employees in each department?

In [33]:
pay.groupby('Department')[['Salary']].mean()

                             Salary
Department
ADMIN HEARNG           78912.947368
ANIMAL CONTRL          66089.684211
AVIATION               76140.018777
BOARD OF ELECTION      56051.142857
BOARD OF ETHICS        94552.500000
BUDGET & MGMT          93925.395349
BUILDINGS              98864.833534
BUSINESS AFFAIRS       80446.425000
CITY CLERK             69762.439024
CITY COUNCIL           63577.172069
COMMUNITY DEVELOPMENT  88363.257143
COPA                   98784.705882
CULTURAL AFFAIRS       87048.909091
DISABILITIES           82431.724138
DoIT                   99681.029703
FAMILY & SUPPORT       79013.588785
FINANCE                73276.364662
FIRE                   97762.348662
GENERAL SERVICES       83095.528390
HEALTH                 85488.210938
HUMAN RELATIONS        93778.588235
HUMAN RESOURCES        79851.761194
INSPECTOR GEN          84030.666667
IPRA                   94429.285714
LAW                    84582.814404
LICENSE APPL COMM      80568.000000
MAYOR'S OFFICE         96165.512308
OEMC                   73153.778221
POLICE                 87836.025349
POLICE BOARD           86136.000000
PROCUREMENT            83278.243902
PUBLIC LIBRARY         71273.288136
STREETS & SAN          84347.775701
TRANSPORTN             89976.896061
TREASURER              88062.652174
WATER MGMNT            89894.111803

## 15. What is the job title of ‘AGAR, BULENT B'?

In [34]:
pay[pay['Name'] == 'AGAR,  BULENT B'][['Job Titles']]

                   Job Titles
230  CHIEF ENGINEER OF SEWERS

## 16. What are the top most common job titles?

In [35]:
pay['Job Titles'].value_counts().head()

Job Titles
POLICE OFFICER                            9393
FIREFIGHTER-EMT                           1424
SERGEANT                                  1118
POOL MOTOR TRUCK DRIVER                    996
POLICE OFFICER (ASSIGNED AS DETECTIVE)     845
Name: count, dtype: int64

## 17. How many people have the word ‘officer’ in their job title? (This is pretty tricky)

In [36]:
def find_string(title):
    if 'officer' in title.lower():
        return True
    else:
        return False

In [37]:
pay['Job Titles'].apply(find_string)

0        False
1        False
2        False
3        False
4        False
         ...
32653     True
32654     True
32655     True
32656     True
32657    False
Name: Job Titles, Length: 32658, dtype: bool

In [38]:
pay['Job Titles'].apply(find_string).sum()

11101

In [39]:
pay

,Unnamed: 0,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate,Salary,Hr Rate
0,0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,$107790.00,NaN,107790.0,NaN
1,1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,$104628.00,NaN,104628.0,NaN
2,2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,$114324.00,NaN,114324.0,NaN
3,3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,$76932.00,NaN,76932.0,NaN
4,4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,$111474.00,NaN,111474.0,NaN
...,...,...,...,...,...,...,...,...,...,...,...
32653,32653,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,F,Salary,NaN,$90024.00,NaN,90024.0,NaN
32654,32654,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,$48078.00,NaN,48078.0,NaN
32655,32655,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,$87006.00,NaN,87006.0,NaN
32656,32656,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,$93354.00,NaN,93354.0,NaN
32657,32657,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,NaN,$115932.00,NaN,115932.0,NaN